In [3]:
import os
import scipy.stats as stats
from scipy.stats import t, norm, probplot
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from math import sqrt, ceil
from ipywidgets import interact, interactive, fixed, interact_manual
import ipywidgets as widgets

microdados = pd.read_excel('microdados.xlsx')

microdados.head()

,NU_ANO,CO_UF_ESCOLA,SG_UF_ESCOLA,CO_MUNICIPIO_ESCOLA,NO_MUNICIPIO_ESCOLA,CO_ESCOLA_EDUCACENSO,NO_ESCOLA_EDUCACENSO,TP_DEPENDENCIA_ADM_ESCOLA,TP_LOCALIZACAO_ESCOLA,NU_MATRICULAS,...,NU_MEDIA_RED,NU_MEDIA_OBJ,NU_MEDIA_TOT,INSE,PC_FORMACAO_DOCENTE,NU_TAXA_PERMANENCIA,NU_TAXA_APROVACAO,NU_TAXA_REPROVACAO,NU_TAXA_ABANDONO,PORTE_ESCOLA
0,2007,11,RO,1100205,Porto Velho,11000058,CENTRO DE ENSINO CLASSE A,4,1,144,...,NaN,NaN,69.03,NaN,NaN,NaN,91.9,8.1,0.0,Maior que 90 alunos
1,2006,11,RO,1100205,Porto Velho,11000058,CENTRO DE ENSINO CLASSE A,4,1,184,...,NaN,NaN,57.82,NaN,NaN,NaN,NaN,NaN,NaN,Maior que 90 alunos
2,2005,11,RO,1100205,Porto Velho,11000058,CENTRO DE ENSINO CLASSE A,4,1,220,...,NaN,NaN,64.83,NaN,NaN,NaN,86.5,12.4,1.1,Maior que 90 alunos
3,2008,11,RO,1100205,Porto Velho,11000058,CENTRO DE ENSINO CLASSE A,4,1,186,...,72.16,60.02,NaN,NaN,NaN,NaN,90.3,9.7,0.0,Maior que 90 alunos
4,2007,11,RO,1100205,Porto Velho,11000171,CENTRO EDUCACIONAL MOJUCA,4,1,19,...,NaN,NaN,58.84,NaN,NaN,NaN,74.2,21.0,4.8,De 1 a 30 alunos

In [7]:
dados = microdados.loc[:,['NU_MEDIA_TOT','NU_ANO', 'SG_UF_ESCOLA','TP_LOCALIZACAO_ESCOLA','PORTE_ESCOLA','NU_TAXA_APROVACAO']]

,NU_MEDIA_TOT,NU_ANO,SG_UF_ESCOLA,TP_LOCALIZACAO_ESCOLA,PORTE_ESCOLA,NU_TAXA_APROVACAO
0,69.03,2007,RO,1,Maior que 90 alunos,91.9
1,57.82,2006,RO,1,Maior que 90 alunos,NaN
2,64.83,2005,RO,1,Maior que 90 alunos,86.5
3,NaN,2008,RO,1,Maior que 90 alunos,90.3
4,58.84,2007,RO,1,De 1 a 30 alunos,74.2

In [8]:
dados.rename(columns={'MEDIA_TOTAL':'MEDIA_TOTAL_ENEM'}, inplace=True)
dados.rename(columns={'NU_ANO':'ANO'}, inplace=True)
dados.rename(columns={'SG_UF_ESCOLA':'UF_ESCOLA'}, inplace=True)
dados.rename(columns={'TP_LOCALIZACAO_ESCOLA':'LOCAL'}, inplace=True)
dados.rename(columns={'PORTE_ESCOLA':'TAMANHO'}, inplace=True)
dados.rename(columns={'NU_TAXA_APROVACAO':'TAXA_APROVACAO'}, inplace=True)
dados.head()

   NU_MEDIA_TOT   ANO UF_ESCOLA  LOCAL              TAMANHO  TAXA_APROVACAO
0         69.03  2007        RO      1  Maior que 90 alunos            91.9
1         57.82  2006        RO      1  Maior que 90 alunos             NaN
2         64.83  2005        RO      1  Maior que 90 alunos            86.5
3           NaN  2008        RO      1  Maior que 90 alunos            90.3
4         58.84  2007        RO      1     De 1 a 30 alunos            74.2

In [20]:
dados['TAMANHO'] = dados['TAMANHO'].astype('category')
dados['UF_ESCOLA'] = dados['UF_ESCOLA'].astype('category')
dados['LOCAL'] = dados['LOCAL'].astype('category')


dados['LOCAL'].cat.categories = ['Urbano', 'Rural']

dadosdados = dados.dropna(axis=0, how='any')
dados.head()

   MEDIA_TOTAL_ENEM   ANO UF_ESCOLA  LOCAL              TAMANHO  \
0             69.03  2007        RO      1  Maior que 90 alunos
2             64.83  2005        RO      1  Maior que 90 alunos
4             58.84  2007        RO      1     De 1 a 30 alunos
6             35.44  2005        RO      1     De 1 a 30 alunos
7             48.46  2005        RO      1    De 61 a 90 alunos

   TAXA_APROVACAO
0            91.9
2            86.5
4            74.2
6            69.3
7            86.5